## Estadistica Aplicada

Sesion 3 - 15 agosto

Alexandra Valdez 1910361

## Tuplas
Es una colección de objetos inmutables (no se puede cambiar)

In [1]:
tupla_alumno = ('Alexandra','Valdez',21)

In [2]:
type(tupla_alumno)

tuple

In [3]:
tupla_alumno.append('LA')

AttributeError: 'tuple' object has no attribute 'append'

In [4]:
tupla_alumno.remove('LA')

AttributeError: 'tuple' object has no attribute 'remove'

In [5]:
tupla_alumno[1]

'Valdez'

## Diccionarios (mapeo de valores)
claves-valor
variables-valor

In [6]:
dic1_alumno = {'Nombre':'Ricardo','Apellido':'Gómez'}

In [7]:
type(dic1_alumno)

dict

In [8]:
grupo_g44 = {'Nombre':['Ricardo','Ale','Jimena'],'Apellido':['Perez','Peña','Huerta']}

In [9]:
grupo_g44

{'Nombre': ['Ricardo', 'Ale', 'Jimena'],
 'Apellido': ['Perez', 'Peña', 'Huerta']}

In [10]:
grupo_g44['Nombre']

['Ricardo', 'Ale', 'Jimena']

In [11]:
grupo_g44.keys()

dict_keys(['Nombre', 'Apellido'])

In [12]:
grupo_g44.values()

dict_values([['Ricardo', 'Ale', 'Jimena'], ['Perez', 'Peña', 'Huerta']])

## Pandas
Libreria para manejar datos estructurados. 

Pandas está construida sobre numpy, por tanto las funciones de numpy se pueden usar en pandas.

Pandas nos ofrece tres tipos de datos:
1. Series (variables unidimensionales)
2. Dataframes (datos organizados en filas y columnas)
3. Panel (tiempo como variable)

Conocemos la edad de 4 personas: Juan 23, Jimena 21, Jorge 9 y Ricardo 15

In [13]:
edades = [23,21,9,15]

In [14]:
edades

[23, 21, 9, 15]

In [15]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [16]:
pip install pandas

Collecting pandas
  Downloading pandas-2.0.3-cp310-cp310-win_amd64.whl (10.7 MB)
     ---------------------------------------- 0.0/10.7 MB ? eta -:--:--
     ---------------------------------------- 0.1/10.7 MB 2.6 MB/s eta 0:00:05
     - -------------------------------------- 0.3/10.7 MB 3.9 MB/s eta 0:00:03
     -- ------------------------------------- 0.6/10.7 MB 5.1 MB/s eta 0:00:02
     --- ------------------------------------ 1.1/10.7 MB 6.1 MB/s eta 0:00:02
     ------ --------------------------------- 1.6/10.7 MB 7.4 MB/s eta 0:00:02
     -------- ------------------------------- 2.2/10.7 MB 8.1 MB/s eta 0:00:02
     ---------- ----------------------------- 2.7/10.7 MB 8.6 MB/s eta 0:00:01
     ------------ --------------------------- 3.3/10.7 MB 9.1 MB/s eta 0:00:01
     -------------- ------------------------- 3.8/10.7 MB 9.4 MB/s eta 0:00:01
     ---------------- ----------------------- 4.4/10.7 MB 9.7 MB/s eta 0:00:01
     ------------------ --------------------- 4.9/10.7 MB 9.9 MB/s eta 0:00:01
     -------------------- ------------------- 5.5/10.7 MB 10.0 MB/s eta 0:00:01
     ---------------------- ----------------- 6.0/10.7 MB 10.1 MB/s eta 0:00:01
     ------------------------ --------------- 6.5/10.7 MB 10.2 MB/s eta 0:00:01
     -------------------------- ------------- 7.0/10.7 MB 10.2 MB/s eta 0:00:01
     ---------------------------- ----------- 7.6/10.7 MB 10.3 MB/s eta 0:00:01
     ------------------------------ --------- 8.1/10.7 MB 10.3 MB/s eta 0:00:01
     -------------------------------- ------- 8.6/10.7 MB 10.4 MB/s eta 0:00:01
     ---------------------------------- ----- 9.1/10.7 MB 10.4 MB/s eta 0:00:01
     ------------------------------------ --- 9.7/10.7 MB 10.5 MB/s eta 0:00:01
     ------------------------------------- - 10.2/10.7 MB 10.5 MB/s eta 0:00:01
     --------------------------------------  10.7/10.7 MB 11.3 MB/s eta 0:00:01
     --------------------------------------  10.7/10.7 MB 11.3 MB/s eta 0:00:01
     --------------------------------------  10.7/10.7 MB 11.3 MB/s eta 0:00:01
     --------------------------------------  10.7/10.7 MB 11.3 MB/s eta 0:00:01
     ---------------------------------------- 10.7/10.7 MB 9.6 MB/s eta 0:00:00
Collecting tzdata>=2022.1
  Downloading tzdata-2023.3-py2.py3-none-any.whl (341 kB)
     ---------------------------------------- 0.0/341.8 kB ? eta -:--:--
     ------------------------------------  337.9/341.8 kB 20.5 MB/s eta 0:00:01
     -------------------------------------- 341.8/341.8 kB 4.2 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.21.0 in c:\users\fcfm\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (1.24.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\fcfm\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
     ---------------------------------------- 0.0/502.3 kB ? eta -:--:--
     ------------------------------------  501.8/502.3 kB 10.7 MB/s eta 0:00:01
     -------------------------------------- 502.3/502.3 kB 6.3 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\fcfm\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.0.3 pytz-2023.3 tzdata-2023.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.0.1 -> 23.2.1
[notice] To update, run: C:\Users\FCFM\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [17]:
import pandas as pd

In [19]:
serie_edades = pd.Series(edades, index=['Juan','Jimena','Jorge','Ricardo'])

In [20]:
type(serie_edades)

pandas.core.series.Series

In [21]:
serie_edades.mean()

17.0

In [22]:
serie_edades.std(ddof=1).round(1)

6.3

In [23]:
serie_edades.median()

18.0

## Dataframes
Datos organizados en filas y columnas (Excel)

In [27]:
alumno1 = ['Juan','Perez',23]
alumno2 = ['Raul','Gonzalez',17]
alumno3 = ['Jimena','Rosas',20]
alumno4 = ['Alejandra','Saldaña',21]

In [28]:
clase_estadistica = [alumno1,alumno2,alumno3,alumno4]

In [29]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [30]:
df_clase = pd.DataFrame(clase_estadistica,columns=['Nombre','Apellido','Edad'])

In [31]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [32]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [33]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df_clase['Edad en dias'] = df_clase['Edad'] * 365

In [35]:
df_clase

      Nombre  Apellido  Edad  Edad en dias
0       Juan     Perez    23          8395
1       Raul  Gonzalez    17          6205
2     Jimena     Rosas    20          7300
3  Alejandra   Saldaña    21          7665

## Seleccion de elementos del dataframe
1. Estándar
2. Selección .iloc
3. .loc
4. Condicionales

In [36]:
## Estándar
df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [37]:
df_clase[['Nombre','Edad']]

      Nombre  Edad
0       Juan    23
1       Raul    17
2     Jimena    20
3  Alejandra    21

In [38]:
df_clase[0]

KeyError: 0

In [39]:
df_clase[0:2]

  Nombre  Apellido  Edad  Edad en dias
0   Juan     Perez    23          8395
1   Raul  Gonzalez    17          6205

In [40]:
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

## Selección por .iloc (posición)
Dataframe.iloc[filas,columnas]

In [41]:
df_clase.iloc[:,1]

0       Perez
1    Gonzalez
2       Rosas
3     Saldaña
Name: Apellido, dtype: object

In [42]:
df_clase.iloc[:,[0,1]]

      Nombre  Apellido
0       Juan     Perez
1       Raul  Gonzalez
2     Jimena     Rosas
3  Alejandra   Saldaña

In [43]:
df_clase.iloc[0,[0,1]]

Nombre       Juan
Apellido    Perez
Name: 0, dtype: object

# Selección por .loc (por etiquetas o por nombres)
dataframe.loc[nombrefilas_nombrecolumnas]

In [44]:
df_clase.loc[:,'Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [45]:
# Cambiar el index
df_clase = df_clase.set_index('Nombre')

In [46]:
df_clase

           Apellido  Edad  Edad en dias
Nombre
Juan          Perez    23          8395
Raul       Gonzalez    17          6205
Jimena        Rosas    20          7300
Alejandra   Saldaña    21          7665

In [47]:
df_clase.loc['Juan','Apellido']

'Perez'

In [48]:
df_clase.loc['Juan','Edad']

23

In [49]:
## Selección SQL
df_clase.Edad

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

## Selección Condicionales
dataframe[condición]

In [50]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Edad en dias
Nombre
Juan         Perez    23          8395
Jimena       Rosas    20          7300
Alejandra  Saldaña    21          7665

## Funciones de Pandas

In [52]:
### sort_values, por default es de menor a mayor
df_clase.sort_values('Edad')

           Apellido  Edad  Edad en dias
Nombre
Raul       Gonzalez    17          6205
Jimena        Rosas    20          7300
Alejandra   Saldaña    21          7665
Juan          Perez    23          8395

In [53]:
### Ordenar de mayor a menor
df_clase.sort_values('Edad', ascending=False)

           Apellido  Edad  Edad en dias
Nombre
Juan          Perez    23          8395
Alejandra   Saldaña    21          7665
Jimena        Rosas    20          7300
Raul       Gonzalez    17          6205

In [54]:
df_clase.sort_values(['Nombre','Edad'])

           Apellido  Edad  Edad en dias
Nombre
Alejandra   Saldaña    21          7665
Jimena        Rosas    20          7300
Juan          Perez    23          8395
Raul       Gonzalez    17          6205

In [55]:
## 
df_clase['Edad'].mean()

20.25

In [56]:
df_clase['Edad'].max()

23

In [57]:
## np.where
import numpy as np

In [58]:
## np.where (condición, valor si se cumple, valor si no se cumple)
df_clase['Mayoría_edad'] = np.where(df_clase['Edad']>=18,'Mayor','Menor')

In [59]:
df_clase

           Apellido  Edad  Edad en dias Mayoría_edad
Nombre
Juan          Perez    23          8395        Mayor
Raul       Gonzalez    17          6205        Menor
Jimena        Rosas    20          7300        Mayor
Alejandra   Saldaña    21          7665        Mayor

In [65]:
# np.select (Si conjunto)
# Condiciones, valor de cada condición, valor si no se cumple ninguna condición
condiciones = [df_clase['Edad']<=17,
               df_clase['Edad']<23,
               df_clase['Edad']>=23]
valores = ['Preparatoria','Universidad','Trabajo']

df_clase['Situación'] = np.select(condiciones,valores,default='Inválido')

In [66]:
df_clase

,Apellido,Edad,Edad en dias,Mayoría_edad,situación,Situación
Nombre,,,,,,
Juan,Perez,23,8395,Mayor,Trabajo,Trabajo
Raul,Gonzalez,17,6205,Menor,Preparatoria,Preparatoria
Jimena,Rosas,20,7300,Mayor,Universidad,Universidad
Alejandra,Saldaña,21,7665,Mayor,Universidad,Universidad

In [67]:
# contar
df_clase.count()

Apellido        4
Edad            4
Edad en dias    4
Mayoría_edad    4
situación       4
Situación       4
dtype: int64

In [68]:
# contar
df_clase['Mayoría_edad'].count()

4

In [70]:
df_clase.groupby('Mayoría_edad').count()['Edad']

Mayoría_edad
Mayor    3
Menor    1
Name: Edad, dtype: int64

In [73]:
df_clase.groupby('Mayoría_edad').mean(numeric_only=True).round(1)

              Edad  Edad en dias
Mayoría_edad
Mayor         21.3        7786.7
Menor         17.0        6205.0